select parent_group_name, group_name, user_name, login_id  from [IM].[VIEW_USER] 
where 
domain_code = '1'
AND user_name in (
'윤빛나',
'윤영석',
'김민범',
'채성원',
'김애형',
'이정희',
'김상남',
'한창민',
'장용석',
'최인석',
'이소원',
'고성철',
'이기현',
'김순호',
'손민우',
'최종건',
'한우현',
'박장남',
'최성민',
'경봉근',
'김진석',
'김정완',
'김수욱',
'조병호',
'김창현',
'김지현',
'이태섭',
'김선태',
'오세훈',
'김학진',
'이효동',
'김연규',
'나대광',
'장연수',
'손민우',
'김현범',
'진만근',
'이덕주',
'이현철',
'송지훈',
'윤영석',
'허건',
'박지훈',
'강승용',
'심현태',
'박지훈',
'성양준',
'박대웅',
'윤상용',
'안명완',
'서정호',
'조원호',
'고은우',
'이준원',
'김나연',
'김두성',
'김승현' )
























































