use mrbook
select * from [dbo].[roominfo]

/******************************************************************************************
* !!회의실 대량 예약 시 이전에 예약되어있는 사람이 있는 필히 확인 후 예약 쿼리 날릴 것 
*******************************************************************************************/
USE [mrbook]

/******************************
* 회의실 예약 변경 쿼리
******************************/
select * from [dbo].[roominfo] where booktype = '1' order by roomNo
select * from [dbo].[mrbooklist] 
where 1=1 
AND roomNo = '17' 
AND bookingdate  '2019-08-13' 

begin tran
update [dbo].[mrbooklist] 
set userName = '김선국', deptName = '경영기획팀', bookinglength = '32'
where rowid = '30581'

-- commit


/******************************
* 회의실 예약 확인 쿼리
******************************/
select * from [dbo].[roominfo] where booktype = '1' order by roomNo
select * from [dbo].[mrbooklist] 
where 1=1 
AND roomNo = '17' 
AND bookingdate > '2019-09-17' 
AND bookingdate < '2019-12-17'
AND userName ='김선국' AND UserID = '941'
AND delYN != 'Y' order by bookingdate 
select * from common.[IM].[VIEW_USER] where user_name = '김선국'   -- 76121 , 941

select * from [dbo].[mrbooklist] 
where 1=1 
AND roomNo = '17' 
AND bookingdate > '2019-09-02' 
AND bookingdate < '2019-09-16'



/******************************
* 회의실 예약 삭제 쿼리
******************************/
begin tran  
update [dbo].[mrbooklist]
set delYN = 'Y'
where 1=1 
AND roomNo = '17' 
AND bookingdate > '2019-09-02' 
AND bookingdate < '2019-09-16'

AND userName ='김선국' AND UserID = '941'

--WHERE rowid in ('20510','20511','20512','20513')
rollback
commit
/******************************
* 회의실 예약 쿼리
******************************/

declare
	@userid varchar(30),
	@userName varchar(20),
	@deptName varchar(20),
	@positionName varchar(20),
	@officePhone varchar(30),
	@roomNo int,
	@Title varchar(100),
	@domainId varchar(2),
	@inputId varchar(30),
	@changeId varchar(30),
	@ip varchar(20),
	@stdd smalldatetime,
	@eddd smalldatetime

set @inputId = '19026'
set @changeId = '19026'
set @ip = '10.120.40.25'
--select * from common.[IM].[VIEW_USER]  WHERE USER_NAME = '김효정' AND domain_code = '1' 
select @userid = user_code, @userName = user_name, @deptName = group_name, @officePhone = office_phone, @positionName = position_name from common.[IM].[VIEW_USER] 
		where login_id = 'kimseonguk21' AND user_name = '김선국' AND domain_code = '1' 
set @roomNo = 17
set @Title = '주류 RPA 시스템 도입 프로젝트'
set @domainId = '1'
set @stdd = '2019-09-02'
set @eddd = '2019-09-16'

print @userid
print @userName
print @deptName
print @officePhone
print @positionName
print @roomNo
print @Title

begin tran	
	while (@stdd <= @eddd)
		begin		
			print @stdd	
			insert into [dbo].[mrbooklist]
			(companyGbn, company, userId, userName, deptName, gradeNm, phoneNum, roomNo, bookingTitle, bookingdate, bookingtime,bookingtimehalf, bookinglength, meetingGbn, apprStat, repeatYn, input, inDate, changeInput, changeDate, lastInIP, delYN, bookType, domain_id)
			values
			('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,@stdd,'7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId)
			set @stdd = DATEADD(Day, 1, @stdd)
		END

--commit
--rollback

select @@trancount






-- 수동
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-01','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-02','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-03','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-04','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-05','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-06','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-07','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-08','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-09','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-10','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-11','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-12','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-13','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-14','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-15','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-16','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-17','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-18','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-19','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId)

--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-20','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-21','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-22','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-23','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-24','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-25','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-26','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-27','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-28','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-29','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-30','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId),
--('','',@userid,@userName,@deptName,@positionName,@officePhone,@roomNo,@Title,'2018-01-31','7','0','32','','Y','N',@inputId,GETDATE(),@changeId,GETDATE(),@ip,'N','1',@domainId)







begin tran
insert into [dbo].[mrbooklist] 
(companyGbn, company, userId, userName, deptName, gradeNm, phoneNum, roomNo, bookingTitle, bookingdate, bookingtime,bookingtimehalf, bookinglength, meetingGbn, apprStat, repeatYn, input, inDate, changeInput, changeDate, lastInIP, delYN, bookType, domain_id)
values 
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-01','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-02','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-03','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-04','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-05','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-06','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-07','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-08','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-09','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-10','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-11','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-12','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-13','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-14','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-15','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-16','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-17','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-18','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-19','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-20','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-21','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-22','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-23','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-24','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-25','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-26','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-27','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-28','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-29','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11'),
('','','28226','박경민','기획담당','책임','02-3479-9201','14','CC TFT 운영','2017-11-30','7','0','32','','Y','N','28226','2017-07-31','28226','2017-07-31','10.120.40.25','N','1','11')




12900			32088	이완상		BI/인사파트		사원	02-6424-7423				10	주류 인사프로젝트	2017-08-10 00:00:00		16	0	2						Y			0	N		32088	2017-08-03 14:53:00	32088	2017-08-03 14:53:00		10.120.40.25	N		1	11
begin tran
insert into [dbo].[mrbooklist] 
(companyGbn, company, userId, userName, deptName, gradeNm, phoneNum, roomNo, bookingTitle, bookingdate, bookingtime,bookingtimehalf, bookinglength, meetingGbn, apprStat, repeatYn, input, inDate, changeInput, changeDate, lastInIP, delYN, bookType, domain_id)
values 
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-08-17','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-08-24','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-08-31','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-09-07','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-09-14','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-09-21','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-09-28','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-10-05','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-10-12','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-10-19','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-10-26','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-11-02','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-11-09','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-11-16','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-11-23','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-11-30','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-12-07','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-12-14','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-12-21','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2017-12-28','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-01-04','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-01-11','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-01-18','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-01-25','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-02-01','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-02-08','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-02-15','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1'),
('','','2013','민창윤','경영지원팀','책임','02-3459-1364','10','주류 인사프로젝트 주간회의','2018-02-22','16','0','2','','Y','N','2013','2017-08-03','2013','2017-08-03','10.120.40.25','N','1','1')


commit