--[dbo].[org_rule_user] where rule_group_id = '8254'


/*******************************
*IM 그룹(메일그룹) 사용자 조회
********************************/
select 
u.user_id,
u.code,
u.name,
u.login_id,
u.email
from [dbo].[org_group_user] AS ogu
left join [dbo].[org_user] AS u
on ogu.user_id = u.user_id
where 1=1
AND ogu.group_id = '8254'   --주류 근태담당 메일그룹 
AND u.domain_id = '1'
--AND u.code in (
'19930376',
'19970138',
'19920106',
'20070669',
'19990269',
'20100007',
'20120269',
'19910296',
'20070148',
'20150247',
'20160041',
'20160007',
'20100009',
'20100001',
'20140007',
'20150026',
'20140025',
'20120271',
'20050676',
'20150215',
'20150154',
'20150174',
'20070998' )

































