select * from [dbo].[org_user] where name = '이경택'
select * from [dbo].[org_user] where name = '영광밴딩'
select 
select * from [dbo].[org_user] where group_id = '5625'
select * from dbo.org_group where group_cd ='3641'
select * from [dbo].[org_user] where sec_level = '2' AND status = '1' AND domain_id = '11'


[dbo].[org_group] where group_id = '3641'



select distinct(group_id) from [dbo].[org_user] where sec_level = '2' AND status = '1' AND domain_id = '11'
order by group_id desc

select name, code, group_id from [dbo].[org_group] where group_id in (
'9741',
'9054',
'9053',
'9052',
'9051',
'9046',
'9045',
'9044',
'9043',
'9042',
'9041',
'8993',
'8417',
'8416',
'8413',
'8412',
'8405',
'7006',
'5683',
'5682',
'5681',
'5677',
'5673',
'5670',
'5669',
'5666',
'5664',
'5663',
'5650',
'5649',
'5648',
'5647',
'5646',
'5645',
'5644',
'5643',
'5642',
'5641',
'5639',
'5638',
'5634',
'5633',
'5631',
'5630',
'5625',
'5624',
'5618',
'5616',
'5615',
'5613',
'5602',
'5601',
'5600',
'5599',
'5598',
'5597',
'5593',
'5592',
'5587',
'5586',
'5585',
'5584',
'5579',
'5578',
'5577',
'5576',
'5575',
'5574',
'5573',
'5572',
'5571',
'5570',
'5568',
'5567',
'5565',
'5564',
'5563',
'5562',
'5561',
'5560',
'5559',
'5558',
'5554',
'5550',
'5549',
'5544',
'5540',
'5536',
'5529',
'5528',
'5527',
'5526',
'5519',
'5518',
'5517',
'5516',
'5515',
'5514',
'5513',
'5503',
'5502',
'5501',
'5492',
'5490',
'5487',
'5485',
'5481',
'5480',
'5479',
'5468',
'5467',
'5463',
'5444',
'5429',
'5427',
'5421',
'5420',
'5414',
'5412',
'5411',
'5410',
'5397',
'5391',
'5390',
'5389',
'5386',
'5380',
'4885',
'3641' )

판매장비담당
동평	SAP_80001	9046
SCM운영담당(외주)	JJ_01186	5682
SCM운영담당(LLC)	JJ_01224	5683
판매장비(기공)	JJ_01471	5681



select U.name, U.code, U.login_id, G.name,U.group_id  from [dbo].[org_user] AS U
left join dbo.org_group AS G
ON U.group_id = G.group_id 
where U.sec_level = '2' AND U.status = '1' AND U.domain_id = '11'  
AND U.group_id in ('5625','5681' , '5682' ,'5683', '9046')  
